Revit 2026 API

# TessellatedFace Properties

---

The TessellatedFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MaterialId | Material of the face. |

#### Reference

TessellatedFace Class

Autodesk.Revit.DB Namespace